
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Соединение();
КонецПроцедуры

Процедура ПутьНачалоВыбора(Элемент, СтандартнаяОбработка)
	 Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	 Диалог.Заголовок = "Укажите путь к базе ...";
	 Если Не Диалог.Выбрать() Тогда
		 Возврат;
	 КонецЕсли;		  
	 Путь = Диалог.Каталог;
КонецПроцедуры
Процедура Соединение()
	 ОбработкаПрерыванияПользователя(); 
	 Состояние("соединение с БД");	
	 Если ВариантПодключения=0 Тогда
		 V8=Новый ComОбъект("V82.ComConnector");
	 Иначе
		 V8=Новый ComОбъект("V83.ComConnector");  
	 КонецЕсли;
	 Если ТипСоединения=1 Тогда
		 ПараметрыСоединения="Srvr="""+СокрЛП(Сервер)+"""; Ref="""+СокрЛП(База)+"""";
	 Иначе
		 ПараметрыСоединения="File=""" + СокрЛП(Путь) + """";
	 КонецЕсли;
	 ПараметрыСоединения=ПараметрыСоединения+"; Usr="""+СокрЛП(Пользователь)+"""; Pwd="""+СокрЛП(Пароль)+""";";
	 Попытка
		 В8=V8.Connect(ПараметрыСоединения);
		 Сообщить("соединение с БД успешно установлено ");
	 Исключение
		 Сообщить(ОписаниеОшибки());
	 КонецПопытки;
 КонецПроцедуры

 Процедура логоНажатие(Элемент)
	 ЗапуститьПриложение("http://gran-it.net");
 КонецПроцедуры
