Функция СведенияОВнешнейОбработке() Экспорт
	ОбщиеМодули = Метаданные.ОбщиеМодули;
								Модуль = ОбщиеМодули.Найти("РаботаВБезопасномРежиме");
								Если Модуль = Неопределено Тогда
									РаботаВБезопасномРежиме=Неопределено; 
								КонецЕсли;
	ВерсияБСП=стандартныеподсистемысервер.версиябиблиотеки();
	МассивВерсии= РазложитьСтрокуВМассивПодстрок(ВерсияБСП,".");
	Если МассивВерсии.Количество()>1 И  (Число(МассивВерсии[1])>=2 и Число(МассивВерсии[1])>=2) Тогда
		ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);
		
		ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
		ПараметрыРегистрации.Версия = "1";
		ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
		ПараметрыРегистрации.Разрешения.Добавить(РаботаВБезопасномРежиме.РазрешениеНаСозданиеCOMКласса("V83.ComConnector","{181E893D-73A4-4722-B61D-D604B3D67D47}"));
		
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
		НоваяКоманда.Представление = НСтр("ru = 'Тест ком подкючения");
		НоваяКоманда.Идентификатор = "Тест COMПодключения";
		НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
		НоваяКоманда.ПоказыватьОповещение = Ложь;
		
		Возврат ПараметрыРегистрации;
		
		
	Иначе
		ПараметрыРегистрации = Новый Структура;
		ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
		//ПараметрыРегистрации.Вставить("Назначение", ...);
		
		ПараметрыРегистрации.Вставить("Наименование", "Тест ком подкючения");
		ПараметрыРегистрации.Вставить("Версия", "1.0");
		ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
		ПараметрыРегистрации.Вставить("Информация", "Тест ком подкючения");
		ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
		ТаблицаКоманд = ПолучитьТаблицуКоманд();
		ДобавитьКоманду(ТаблицаКоманд,
		"Тест ком подкючения",
		"1",
		"ОткрытиеФормы",
		Истина,""
		//<Модификатор>
		
		);
		ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
		Возврат ПараметрыРегистрации;
		
		
	КонецЕсли;
	
	
КонецФункции
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	МассивСтрок = Новый Массив;
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
КонецФункции
Функция ПолучитьТаблицуКоманд()
    Команды = Новый ТаблицаЗначений;
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры