
&НаКлиенте
Процедура ТипСоединенияПриИзменении(Элемент)
	ФДост=?(Объект.ТипСоединения=1,Ложь,Истина);	
	ЭтаФорма.Элементы.Путь.Доступность	=ФДост;	
	ЭтаФорма.Элементы.Сервер.Доступность=НЕ ФДост;
	ЭтаФорма.Элементы.База.Доступность	=НЕ ФДост;
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	

В8=Соединение();
Если Не В8=Неопределено Тогда  	
	Сообщить("Соединение выполнено успешно");
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)


	ПроверитьСоединениеНаСервере();
КонецПроцедуры
&НаСервере
Функция Соединение()
	//ОбработкаПрерыванияПользователя(); 
	//Состояние("соединение с УТ11");	   ОбщегоНазначения.ИмяCOMСоединителя().
	
	Если Объект.ВариантПодключения=0 Тогда
		Если Объект.ТипКоннектора=0  Тогда
			ИмяСоединения=ИмяCOMСоединителя();
		ИначеЕсли Объект.ТипКоннектора=1 Тогда
			ИмяСоединения="V83.Application";
		ИначеЕсли Объект.ТипКоннектора=2 Тогда
			ИмяСоединения="V83c.Application";
		КонецЕсли;
	ИначеЕсли Объект.ВариантПодключения=1 Тогда		
		Если Объект.ТипКоннектора=0  Тогда
			ИмяСоединения="V82.ComConnector";
		ИначеЕсли Объект.ТипКоннектора=1 Тогда
			ИмяСоединения="V82.Application";
		ИначеЕсли Объект.ТипКоннектора=2 Тогда
			ИмяСоединения="V82c.Application";
		КонецЕсли;
		
	ИначеЕсли Объект.ВариантПодключения=2 Тогда	
		Если Объект.ТипКоннектора=0  Тогда
			ИмяСоединения="V83.ComConnector";
		ИначеЕсли Объект.ТипКоннектора=1 Тогда
			ИмяСоединения="V83.Application";
		ИначеЕсли Объект.ТипКоннектора=2 Тогда
			ИмяСоединения="V83c.Application";
		КонецЕсли;
	ИначеЕсли  Объект.ВариантПодключения=3 Тогда
		v7 = Новый COMОбъект("V1CEnterprise.Application");
	
	НайденыНезаполненныеПоля = Ложь;
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда 
		Name = СокрЛП(Объект.Пользователь);  
	Иначе
		Сообщить("Не указано имя пользователя!");
		НайденыНезаполненныеПоля = Истина;
	КонецЕсли;
	pass = Объект.Пароль;
	
	Если ЗначениеЗаполнено(Объект.Путь) Тогда
		База77 = СокрЛП(Объект.Путь);
	Иначе
		Сообщить("Не указана база 77!");
		НайденыНезаполненныеПоля = Истина;
	КонецЕсли;
	Если НайденыНезаполненныеПоля Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ОткрытиеБазы = v7.Initialize(v7.RMTrade, "/d"+База77+" /n"+Name+" /p"+Pass, "NO_SPLASH_SHOW");
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить(); 
		Возврат Неопределено;
	КонецПопытки;	
	
	Если Не ОткрытиеБазы Тогда
		возврат Неопределено;
	КонецЕсли;
	
	возврат v7;

		
	КонецЕсли;
	
	
	V8=Новый ComОбъект(ИмяСоединения);
	ПараметрыСоединения="";
	Если Объект.ТипСоединения=1 Тогда
		ПараметрыСоединения="Srvr="""+СокрЛП(Объект.Сервер)+"""; Ref="""+СокрЛП(Объект.База)+"""";
	ИначеЕсли  Объект.ТипСоединения=0 Тогда
		ПараметрыСоединения="File=""" + СокрЛП(Объект.Путь) + """";
	//ИначеЕсли  Объект.ТипСоединения=2 Тогда
	//	ПараметрыСоединения=Объект.СтрокаПодключения;
	КонецЕсли;
	ПараметрыСоединения=ПараметрыСоединения+"; Usr="""+СокрЛП(Объект.Пользователь)+"""; Pwd="""+СокрЛП(Объект.Пароль)+""";";
	Попытка
		В8=?(Объект.ТипСоединения=2,V8.Connect(Объект.СтрокаПодключения),V8.Connect(ПараметрыСоединения));
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	Возврат В8;
	
КонецФункции
Функция ИмяCOMСоединителя() 
	СистемнаяИнфо = Новый СистемнаяИнформация;
	ПодстрокиВерсии = РазложитьСтрокуВМассивПодстрок(СистемнаяИнфо.ВерсияПриложения, "."); 
	Возврат "v" + ПодстрокиВерсии[0] + ПодстрокиВерсии[1] + ".COMConnector";
КонецФункции
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	МассивСтрок = Новый Массив;
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТипСоединенияПриИзменении(Неопределено)
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСайтРазработчика(Команда)
	ЗапуститьПриложение("http://gran-it.net/updateset.php");
КонецПроцедуры


